package b_Chapter01;

// 데이터
// 세계에 존재하는 정보를 총칭( 컴퓨터의 저장 장치에 기록한 정보)
// 기계어를 통해 데이터를 인식하고 처리
public class A_Variable {

	public static void main(String[] args) {
//		변수(variable) : 데이터를 저장할 수있는 메모리 공간
//		변수 선언 : 메모리 공간을 생성
//		>> 컴퓨터에게 데이터를 가져올 상자를 알려줌
//		>> 컴퓨터는 상자 안에 있는 내용물을 가져다줌
		
//		변수 선언 방법 : 상자를 생성하는 것
//		데이터타입 변수명;
		
//		변수 초기화 방법 : 상자에 데이터를 담는 것
//		변수명 = 값;
		
//		변수 선언과 동시에 초기화
//		데이터타입 변수명 = 데이터값;
//		int i=0;
		
		
//		변수 명명 규칙
//		문자,숫자,기호를 사용
//		대소문자 구분, 길이에 제한이 없음
//			: Name , name 서로 다름.
//		숫자로 시작할 수 없음
//			: top100(가능), 7top(불가능)
//		기호는 _(언더스코어), $(달러)만 가능
//			: _hello, $hi
//		카멜케이스를 사용,  시작 단어는 소문자로 시작
//		studentName, socreTotal
//		전체 대문자 사용을 지양 : 상수(전체 대문자) 와 구분하기 위함
//		자바의 예약어, 키워드는 변수명으로 사용하지 않음
//		예약어 - if for class byte 등등
		
		
//		상수 (Constant) : 프로그램 실행 동안 그 값이 변경되지 않는 변수를 의미
//		1. 상수 선언 및 초기회
//		자바에서는 final 키워드를 사용하여 상수를 선언
//		데이터타입 상수명 = 데이터값;
		
//		2. 상수의 특징
//		초기화 이후에는 값을 변경할 수 없음
//		보통 대문자로 명명
//		일반적으로 공갸된 값이나 변경되지 않는 값들을 정의할 때 사용 (파이 : PI)
//		final 데이터타입 PI = 3.14159;
//		final 데이터타입 RESIDENT_NUMBER = 123456;
		
//		3. 상수 명명 규칙
//		전체 대문자로 명명을 권장
//		스네이크 케이스를 사용(단어와 단어 사이를  _로 구분)
		
		
	}

}
